// import 'package:dotp_info/src/utils/image_resource_manager.dart';

// const baseUrl = "http://103.89.50.68:8080/api/";
// const imageBaseUrl = "http://103.89.50.68:8080/StaticFiles/";

// const String getAllActivity = "${baseUrl}MobileActivity/GetAllActivities";
// const String getActivityById = "${baseUrl}MobileActivity/GetActivityById";
// const String getAllTender = "${baseUrl}MobileTender/GetAllTender";
// const String getAllAnnouncement = "${baseUrl}MobileAnnouncement/GetAllAnnouncements";
// const String getAllBranchOffice = "${baseUrl}MobileBranchOffice/GetAllBranchOffices";
// const String getAllLegalMethodNameList = "${baseUrl}MobileLaw/GetLawTypeNameList";
// const String getAllLatestNews = "${baseUrl}MobileNews/GetAllNews";
// const String getAllTelevisionNews = "${baseUrl}MobileTelevisionNews/GetAllTelevisionNews";

// List<Map<String, dynamic>> simpleData = [
//   {
//     "description":
//         "စက်မှုလက်မှုသင်တန်းဌာနခွဲကဖွင့်လှစ်သည့် လျှပ်စစ်အခြေခံ သင်တန်းအမှတ်စဉ်(၃၆/၂၀၂၄) သင်တန်းဖွင့်ပွဲအခမ်းအနားကျင်းပ"
//   },
//   {
//     "description":
//         "နိုင်ငံတော်စီမံအုပ်ချုပ်ရေးကောင်စီဝင်၊ ဒုတိယဝန်ကြီးချုပ်နှင့် ပို့ဆောင်ရေးနှင့်ဆက်သွယ်ရေးဝန်ကြီးဌာန၊ ပြည်ထောင်စုဝန်ကြီး ဗိုလ်ချုပ်ကြီးမြထွန်းဦး ရုရှားဖက်ဒရေးရှင်းနိုင်ငံ၊ ဗလာဒီဗော့စတော့မြို့တွင် (၉) ကြိမ်မြောက် အရှေ့ဖျားစီးပွားရေးဖိုရမ်သို့ တက်ရောက်"
//   },
//   {
//     "description":
//         "နိုင်ငံတော်စီမံအုပ်ချုပ်ရေးကောင်စီအဖွဲ့ဝင်၊ ဒုတိယဝန်ကြီးချုပ်နှင့် ပို့ဆောင်ရေးနှင့်ဆက်သွယ်ရေးဝန်ကြီးဌာန ပြည်ထောင်စုဝန်ကြီး ဗိုလ်ချုပ်ကြီးမြထွန်းဦး မြန်မာနိုင်ငံဆိုင်ရာ တရုတ်နိုင်ငံသံအမတ်ကြီး H.E. Ms. Ma Jia အား လက်ခံတွေ့ဆုံ"
//   },
//   {
//     "description":
//         "နိုင်ငံတော်စီမံအုပ်ချုပ်ရေးကောင်စီအဖွဲ့ဝင်၊ ဒုတိယဝန်ကြီးချုပ်နှင့် ပို့ဆောင်ရေးနှင့်ဆက်သွယ်ရေးဝန်ကြီးဌာန ပြည်ထောင်စုဝန်ကြီး ဗိုလ်ချုပ်ကြီးမြထွန်းဦး သဘာဝဘေးအန္တရာယ်ကြောင့် ရထားလမ်းနှင့်တံတားများ ပျက်စီးမှုနှင့် ပြန်လည်ပြုပြင်ဆောင်ရွက်မှု အခြေအနေများအား ကြည့်ရှုစစ်ဆေး"
//   },
//   {
//     "description":
//         "နိုင်ငံတော်စီမံအုပ်ချုပ်ရေးကောင်စီအဖွဲ့ဝင်၊ ဒုတိယဝန်ကြီးချုပ်နှင့် ပို့ဆောင်ရေးနှင့်ဆက်သွယ်ရေးဝန်ကြီးဌာန ပြည်ထောင်စုဝန်ကြီး ဗိုလ်ချုပ်ကြီးမြထွန်းဦး မြန်မာနိုင်ငံဆိုင်ရာ တရုတ်နိုင်ငံသံအမတ်ကြီး H.E. Ms. Ma Jia အား လက်ခံတွေ့ဆုံ"
//   },
//   {
//     "description":
//         "စက်မှုလက်မှုသင်တန်းဌာနခွဲကဖွင့်လှစ်သည့် လျှပ်စစ်အခြေခံ သင်တန်းအမှတ်စဉ်(၃၆/၂၀၂၄) သင်တန်းဖွင့်ပွဲအခမ်းအနားကျင်းပ"
//   },
//   {
//     "description":
//         "နိုင်ငံတော်စီမံအုပ်ချုပ်ရေးကောင်စီအဖွဲ့ဝင်၊ ဒုတိယဝန်ကြီးချုပ်နှင့် ပို့ဆောင်ရေးနှင့်ဆက်သွယ်ရေးဝန်ကြီးဌာန ပြည်ထောင်စုဝန်ကြီး ဗိုလ်ချုပ်ကြီးမြထွန်းဦး မြန်မာနိုင်ငံဆိုင်ရာ တရုတ်နိုင်ငံသံအမတ်ကြီး H.E. Ms. Ma Jia အား လက်ခံတွေ့ဆုံ"
//   },
//   {
//     "description":
//         "စက်မှုလက်မှုသင်တန်းဌာနခွဲကဖွင့်လှစ်သည့် လျှပ်စစ်အခြေခံ သင်တန်းအမှတ်စဉ်(၃၆/၂၀၂၄) သင်တန်းဖွင့်ပွဲအခမ်းအနားကျင်းပ"
//   },
//   {
//     "description":
//         "နိုင်ငံတော်စီမံအုပ်ချုပ်ရေးကောင်စီအဖွဲ့ဝင်၊ ဒုတိယဝန်ကြီးချုပ်နှင့် ပို့ဆောင်ရေးနှင့်ဆက်သွယ်ရေးဝန်ကြီးဌာန ပြည်ထောင်စုဝန်ကြီး ဗိုလ်ချုပ်ကြီးမြထွန်းဦး မြန်မာနိုင်ငံဆိုင်ရာ တရုတ်နိုင်ငံသံအမတ်ကြီး H.E. Ms. Ma Jia အား လက်ခံတွေ့ဆုံ"
//   },
//   {
//     "description":
//         "စက်မှုလက်မှုသင်တန်းဌာနခွဲကဖွင့်လှစ်သည့် လျှပ်စစ်အခြေခံ သင်တန်းအမှတ်စဉ်(၃၆/၂၀၂၄) သင်တန်းဖွင့်ပွဲအခမ်းအနားကျင်းပ"
//   },
//   {
//     "description":
//         "နိုင်ငံတော်စီမံအုပ်ချုပ်ရေးကောင်စီအဖွဲ့ဝင်၊ ဒုတိယဝန်ကြီးချုပ်နှင့် ပို့ဆောင်ရေးနှင့်ဆက်သွယ်ရေးဝန်ကြီးဌာန ပြည်ထောင်စုဝန်ကြီး ဗိုလ်ချုပ်ကြီးမြထွန်းဦး မြန်မာနိုင်ငံဆိုင်ရာ တရုတ်နိုင်ငံသံအမတ်ကြီး H.E. Ms. Ma Jia အား လက်ခံတွေ့ဆုံ"
//   },
//   {
//     "description":
//         "နိုင်ငံတော်စီမံအုပ်ချုပ်ရေးကောင်စီအဖွဲ့ဝင်၊ ဒုတိယဝန်ကြီးချုပ်နှင့် ပို့ဆောင်ရေးနှင့်ဆက်သွယ်ရေးဝန်ကြီးဌာန ပြည်ထောင်စုဝန်ကြီး ဗိုလ်ချုပ်ကြီးမြထွန်းဦး မြန်မာနိုင်ငံဆိုင်ရာ တရုတ်နိုင်ငံသံအမတ်ကြီး H.E. Ms. Ma Jia အား လက်ခံတွေ့ဆုံ"
//   },
//   {
//     "description":
//         "နိုင်ငံတော်စီမံအုပ်ချုပ်ရေးကောင်စီအဖွဲ့ဝင်၊ ဒုတိယဝန်ကြီးချုပ်နှင့် ပို့ဆောင်ရေးနှင့်ဆက်သွယ်ရေးဝန်ကြီးဌာန ပြည်ထောင်စုဝန်ကြီး ဗိုလ်ချုပ်ကြီးမြထွန်းဦး မြန်မာနိုင်ငံဆိုင်ရာ တရုတ်နိုင်ငံသံအမတ်ကြီး H.E. Ms. Ma Jia အား လက်ခံတွေ့ဆုံ"
//   },
// ];

// String taskAndDutyTextA =
//     "(က) ကုန်းလမ်းသယ်ယူပို့ဆောင်ရေးလုပ်ငန်းများဥပဒေအရ စီးပွားရေးအလို့ငှာ ပြည်တွင်း နှင့် နယ်စပ်ဖြတ်ကျော်သယ်ယူပို့ဆောင်ရေး လုပ်ငန်းဆောင်ရွက်သူများအား လည်းကောင်း၊ ဘက်စုံသယ်ယူပို့ဆောင်ရေးဥပဒေအရ လုပ်ငန်းဆောင်ရွက်သူများအား လည်းကောင်း လိုင်စင်၊ မှတ်ပုံတင်လက်မှတ်များ ထုတ်ပေးခြင်း၊ အခွန် အခများ စည်းကြပ်ကောက်ခံခြင်း၊ သတ်မှတ်စည်းကမ်းများ လိုက်နာစေရေး ကြီးကြပ်ခြင်း၊";
// String taskAndDutyTextB =
//     "(ခ) အထက်ဌာန အဖွဲ့အစည်းများ၏ တာဝန်ပေးအပ်ချက်အရ နိုင်ငံတော်အဆင့်နှင့် ဒေသအစိုးရအဆင့် အခမ်းအနားများ၊ အရေးပေါ်ကိစ္စများအတွက် ယာဉ်များအား သက်ဆိုင်သည့် ဌာနများနှင့် ညှိနှိုင်းပေါင်းစပ်စီစဉ်ဆောင်ရွက်ပေးခြင်း၊";
// String taskAndDutyTextC =
//     "(ဂ) နှစ်ရှည်၊ နှစ်လတ်၊ နှစ်တိုနှင့် နှစ်စဉ်ဆောင်ရွက်မည့် ပို့ဆောင်ရေးဆိုင်ရာ စီမံကိန်းများ အကောင်အထည်ဖေါ် ဆောင်ရွက်နိုင်ရေးအတွက် ဆက်စပ် အဖွဲ့အစည်းများနှင့် ညှိနှိုင်းပေါင်းစပ်ဆောင်ရွက်ခြင်း၊";
// String taskAndDutyTextD =
//     "(ဃ) National Transport Master Plan နှင့် National Logistics Master Plan ပါ Action Plan များကို အကောင်အထည်ဖော်နိုင်ရေး ဆောင်ရွက်ခြင်း၊";
// String taskAndDutyTextE =
//     "(င) ပုဂ္ဂလိက သယ်ယူပို့ဆောင်ရေးကဏ္ဍ ဖွံ့ဖြိုးတိုးတက်စေရေးအတွက် PPP Unit နှင့် PPP Centerတို့၏ လုပ်ငန်းစဉ်များအား ဆောင်ရွက်ရာတွင် ပံ့ပိုးပေးခြင်း၊";
// String taskAndDutyTextF =
//     "(စ) ဝန်ကြီးဌာနလက်အောက်ရှိ ဌာန၊ အဖွဲ့အစည်းအားလုံး၏ စီမံကိန်းလုပ်ငန်းများကို ဝန်ကြီးဌာနအတွင်းစာရင်းစစ်အဖြစ် စစ်ဆေးခြင်းနှင့် ဦးစီးဌာန ဒေသရုံးများ၏ ဘဏ္ဍာငွေအရ/ အသုံးဆိုင်ရာများအား တာဝန်ခံဆောင်ရွက်ခြင်း၊ ဘဏ္ဍာရေး ဆိုင်ရာ စိစစ်ခြင်း၊ ခွင့်ပြုခြင်း၊ ကြီးကြပ်ခြင်း၊ စစ်ဆေးခြင်း။";
// String bodyText =
//     "ပို့ဆောင်ရေးနှင့်ဆက်သွယ်ရေးဝန်ကြီးဌာန၊ မြန်မာ့ဆက်သွယ်ရေးလုပ်ငန်း၏ (၁၃)ကြိမ်မြောက် စုပေါင်း သွေးလှူဒါန်းပွဲကို ယနေ့တွင် နေပြည်တော်ကုတင် (၁၀၀၀) အထွေထွေရောဂါကု ဆေးရုံကြီး၌ ကျင်းပပြုလုပ်ခဲ့ရာ နိုင်ငံတော်စီမံအုပ်ချုပ်ရေးကောင်စီအဖွဲ့ဝင် ဒုတိယဝန်ကြီးချုပ်နှင့် ပြည်ထောင်စုဝန်ကြီး ဗိုလ်ချုပ်ကြီး မြထွန်းဦး သွားရောက်ကြည့်ရှု အားပေးသည်။ ယခုစုပေါင်းသွေးလှူဒါန်းပွဲတွင် နေပြည်တော်ရှိ မြန်မာ့ဆက်သွယ်ရေးလုပ်ငန်းမှ ဝန်ထမ်းများနှင့် စေတနာ သွေးလှူရှင် စုစုပေါင်း (၆၀) ဦးတို့ ပါဝင်လှူဒါန်းခဲ့ကြပြီး သွေးလှူဒါန်းပွဲသို့ ဒုတိယဝန်ကြီးချုပ်နှင့် ပြည်ထောင်စုဝန်ကြီး ဗိုလ်ချုပ်ကြီး မြထွန်းဦး၊ ကျန်းမာရေးဝန်ကြီးဌာန ပြည်ထောင်စုဝန်ကြီး ဒေါက်တာသက်ခိုင်ဝင်း၊ ဒုတိယဝန်ကြီးများ၊ ဌာနကြီးမှူးများ၊ ဆေးရုံအုပ်ကြီးနှင့် တာဝန်ရှိသူတို့က လိုက်လံကြည့်ရှုအားပေးခဲ့ကြကာ အားဖြည့် စားသောက်ဖွယ်ရာများနှင့် ဆေးဝါးများကိုပေးအပ်ခဲ့ကြသည်။ ထို့နောက် ကျန်းမာရေးဝန်ကြီးဌာန ပြည်ထောင်စုဝန်ကြီး ဒေါက်တာသက်ခိုင်ဝင်းက သွေးလှူဒါန်းမှုအတွက် ဂုဏ်ပြုမှတ်တမ်းလွှာကိုပေးအပ်ခဲ့ပြီး ဒုတိယဝန်ကြီးချုပ်နှင့် ပြည်ထောင်စုဝန်ကြီး ဗိုလ်ချုပ်ကြီးမြထွန်းဦးက အမှတ်တရလက်ဆောင်များ ပြန်လည်ပေးအပ်ခဲ့သည်။ မြန်မာ့ဆက်သွယ်ရေးလုပ်ငန်း၏ (၁၃)ကြိမ်မြောက် စုပေါင်းသွေးလှူဒါန်းပွဲကို နေပြည်တော်၊ ရန်ကုန်၊ မန္တလေး၊ တနင်္သာရီ၊ ရှမ်းပြည်နယ်(အရှေ့ပိုင်း) နှင့် ရှမ်းပြည်နယ် (မြောက်ပိုင်း)ရှိ သက်ဆိုင်ရာ ဆေးရုံများနှင့် သွေးဌာနများတွင် ကျင်းပပြုလုပ်ခဲ့ပြီး စုစုပေါင်း သွေးလှူရှင် (၄၀၆)ဦး ပါဝင်လှူဒါန်းခဲ့ကာ စုပေါင်း သွေးလှူဒါန်းမှုများကို ၂၀၁၆ ခုနှစ်မှ စတင် စီစဉ် ဆောင်ရွက်ခဲ့ရာ ယခုအခါ (၁၃) ကြိမ်မြောက်ခဲ့ပြီ ဖြစ်ကြောင်း သတင်းရရှိသည်။";
// String headerText =
//     "နိုင်ငံတော်စီမံအုပ်ချုပ်ရေးကောင်စီအဖွဲ့ဝင် ဒုတိယဝန်ကြီးချုပ်နှင့် ပို့ဆောင်ရေးနှင့်ဆက်သွယ်ရေးဝန်ကြီးဌာန ပြည်ထောင်စုဝန်ကြီး ဗိုလ်ချုပ်ကြီး မြထွန်းဦး နေပြည်တော် ကုတင် (၁၀၀၀) အထွေထွေရောဂါကုဆေးရုံကြီးတွင် ကျင်းပပြုလုပ်သည့် မြန်မာ့ဆက်သွယ်ရေးလုပ်ငန်း၏ (၁၃)ကြိမ်မြောက် စုပေါင်းသွေးလှူဒါန်းပွဲကို ကြည့်ရှုအားပေး";
// String historyBodyText =
//     "တော်လှန်ရေးကောင်စီက ၁၉၇၂ခုနှစ် ၊ မတ်လ (၁၅)ရက်နေ့၌ အုပ်ချုပ်ရေးစနစ်သစ် ဖော်ဆောင်ခဲ့စဉ် ယင်းအုပ်ချုပ်ရေးစနစ်သစ်နှင့်အညီ ပို့ဆောင်ဆက်သွယ်ရေးဝန်ကြီးဌာန (Ministry of Transport and Telecommunications) ၏အောက်တွင် ဆက်သွယ်ရေးဆိုင်ရာ ပြည်တွင်း ပြည်ပဥပဒေ၊ နည်းဥပဒေ၊ ညွှန်ကြားချက်၊ အမိန့်လုပ်ထုံးလုပ်နည်း စသည်တို့ကို လိုက်နာစေရန် ထိန်းသိမ်းကွပ်ကဲသည့် အဖွဲ့ အဖြစ် ဆက်သွယ်ရေးညွှန်ကြားမှုဦးစီးဌာနနှင့် ဆက်သွယ်ရေး ဝန်ဆောင်မှုလုပ်ငန်း (စာတိုက်/ ကြေးနန်း / တယ်လီဖုန်း )လုပ်ကိုင်သည့် ဆက်သွယ်ရေးကော်ပိုရေးရှင်းဟူ၍ အဖွဲ့အစည်းနှစ်ရပ် ပြင်ဆင် ဖွဲ့စည်းခဲ့ပါသည်။ နိုင်ငံတော်အစိုးရမှ ဆက်သွယ်ရေးနှင့် သတင်းနည်းပညာ ကဏ္ဍဖွံ့ဖြိုးတိုးတက်ရေးသည် တစ်မျိုးသားလုံး၊ တစ်နိုင်ငံလုံး ဘက်စုံဖွံ့ဖြိုးတိုးတက်မှုအတွက် အခြေခံဖြစ်သည်ဟု ခံယူထားသည် နှင့်အညီ ပြည်တွင်းရှိ ဆက်သွယ်ရေးနှင့် သတင်းနည်းပညာကဏ္ဍ ဖွံ့ဖြိုးတိုးတက်ရေး လုပ်ငန်းစဉ် များ ကို ဆက်သွယ်ရေးကွန်ရက်များ တိုးချဲ့တည်ဆောက်ခြင်း၊ နည်းပညာသစ်များကို အသုံးပြု၍ ပိုမို အရည်အသွေးမြင့်မားသည့် ဝန်ဆောင်မှုများပေးနိုင်ရန် ပို့ဆောင်ရေးနှင့် ဆက်သွယ်ရေး၀န်ကြီးဌာနက ကြိုးပမ်းဆောင်ရွက်နေသကဲ့သို့ ICT ကဏ္ဍတွင် ဒေသတွင်းနှင့် နိုင်ငံတကာ ပူးပေါင်းဆောင်ရွက်ရေး အစီအစဉ်များ၌လည်း တိုးတက်အောင်ဆောင်ရွက်လျက် ရှိပါသည်။ နိုင်ငံတော်အစိုးရမှ ဆက်သွယ်ရေးနှင့် သတင်းနည်းပညာ ကဏ္ဍဖွံ့ဖြိုးတိုးတက်ရေးသည် တစ်မျိုးသားလုံး၊ တစ်နိုင်ငံလုံး ဘက်စုံဖွံ့ဖြိုးတိုးတက်မှုအတွက် အခြေခံဖြစ်သည်ဟု ခံယူထားသည် နှင့်အညီ ပြည်တွင်းရှိ ဆက်သွယ်ရေးနှင့် သတင်းနည်းပညာကဏ္ဍ ဖွံ့ဖြိုးတိုးတက်ရေး လုပ်ငန်းစဉ် များ ကို ဆက်သွယ်ရေးကွန်ရက်များ တိုးချဲ့တည်ဆောက်ခြင်း၊ နည်းပညာသစ်များကို အသုံးပြု၍ ပိုမို အရည်အသွေးမြင့်မားသည့် ဝန်ဆောင်မှုများပေးနိုင်ရန် ပို့ဆောင်ရေးနှင့် ဆက်သွယ်ရေး၀န်ကြီးဌာနက ကြိုးပမ်းဆောင်ရွက်နေသကဲ့သို့ ICT ကဏ္ဍတွင် ဒေသတွင်းနှင့် နိုင်ငံတကာ ပူးပေါင်းဆောင်ရွက်ရေး အစီအစဉ်များ၌လည်း တိုးတက်အောင်ဆောင်ရွက်လျက် ရှိပါသည်။ နိုင်ငံတော်အစိုးရမှ ဆက်သွယ်ရေးနှင့် သတင်းနည်းပညာ ကဏ္ဍဖွံ့ဖြိုးတိုးတက်ရေးသည် တစ်မျိုးသားလုံး၊ တစ်နိုင်ငံလုံး ဘက်စုံဖွံ့ဖြိုးတိုးတက်မှုအတွက် အခြေခံဖြစ်သည်ဟု ခံယူထားသည် နှင့်အညီ ပြည်တွင်းရှိ ဆက်သွယ်ရေးနှင့် သတင်းနည်းပညာကဏ္ဍ ဖွံ့ဖြိုးတိုးတက်ရေး လုပ်ငန်းစဉ် များ ကို ဆက်သွယ်ရေးကွန်ရက်များ တိုးချဲ့တည်ဆောက်ခြင်း၊ နည်းပညာသစ်များကို အသုံးပြု၍ ပိုမို အရည်အသွေးမြင့်မားသည့် ဝန်ဆောင်မှုများပေးနိုင်ရန် ပို့ဆောင်ရေးနှင့် ဆက်သွယ်ရေး၀န်ကြီးဌာနက ကြိုးပမ်းဆောင်ရွက်နေသကဲ့သို့ ICT ကဏ္ဍတွင် ဒေသတွင်းနှင့် နိုင်ငံတကာ ပူးပေါင်းဆောင်ရွက်ရေး အစီအစဉ်များ၌လည်း တိုးတက်အောင်ဆောင်ရွက်လျက် ရှိပါသည်။";
// String latestNewsBodyText =
//     "၁၉၆ဝ ပြည့်နှစ်၊ ဇန်နဝါရီလ (၂၅) ရက်နေ့စ၍ စာတိုက်နှင့်ကြေးနန်းဌာန ( Posts and Telegraph Department) အဖြစ် ပူးပေါင်းဖွဲ့စည်းကာ သယ်ယူပို့ဆောင်ရေးနှင့် လမ်းပန်းဆက်သွယ်ရေး ဝန်ကြီး ဌာန၏ ကြီးကြပ်ကွပ်ကဲမှုအောက်၌ ဆက်သွယ်ရေးလုပ်ငန်းများကို ဆောင်ရွက်ခဲ့ပါသည်။ ဌာန အကြီးအကဲမှာ ညွှန်ကြားရေးမှူးချုပ်( Director General ) ဖြစ်ပါသည်။ ညွန်ကြားရေးမှူးချုပ်ကို စာတိုက်ညွှန်ကြားရေးမှူး ( Director of Posts ) နှင့် ကြေးနန်းဆက်သွယ်ရေးညွှန်ကြားရေးမှူး ( Director of Telecommunications ) တို့က တိုက်ရိုက်တာဝန်ခံလျက် မြန်မာနိုင်ငံတစ်ဝှမ်းလုံးကို စာတိုက်လုပ်ငန်းအတွက် တိုင်း (၁၁)တိုင်း၊ ကြိုးမဲ့ ဆက်သွယ်ရေးအတွက် တိုင်း(၂)တိုင်း၊ ကြေးနန်း ဆက်သွယ်ရေးအတွက် တိုင်း (၃)တိုင်း သတ်မှတ် ပိုင်းခြားဆောင်ရွက်ခဲ့ပါသည်။";
// String announcementBodyText =
//     "တော်လှန်ရေးကောင်စီက ၁၉၇၂ခုနှစ် ၊ မတ်လ (၁၅)ရက်နေ့၌ အုပ်ချုပ်ရေးစနစ်သစ် ဖော်ဆောင်ခဲ့စဉ် ယင်းအုပ်ချုပ်ရေးစနစ်သစ်နှင့်အညီ ပို့ဆောင်ဆက်သွယ်ရေးဝန်ကြီးဌာန (Ministry of Transport and Telecommunications) ၏အောက်တွင် ဆက်သွယ်ရေးဆိုင်ရာ ပြည်တွင်း ပြည်ပဥပဒေ၊ နည်းဥပဒေ၊ ညွှန်ကြားချက်၊ အမိန့်လုပ်ထုံးလုပ်နည်း စသည်တို့ကို လိုက်နာစေရန် ထိန်းသိမ်းကွပ်ကဲသည့် အဖွဲ့ အဖြစ် ဆက်သွယ်ရေးညွှန်ကြားမှုဦးစီးဌာနနှင့် ဆက်သွယ်ရေး ဝန်ဆောင်မှုလုပ်ငန်း (စာတိုက်/ ကြေးနန်း / တယ်လီဖုန်း )လုပ်ကိုင်သည့် ဆက်သွယ်ရေးကော်ပိုရေးရှင်းဟူ၍ အဖွဲ့အစည်းနှစ်ရပ် ပြင်ဆင် ဖွဲ့စည်းခဲ့ပါသည်။";
// String licenseListBodyText =
//     "တော်လှန်ရေးကောင်စီက ၁၉၇၂ခုနှစ် ၊ မတ်လ (၁၅)ရက်နေ့၌ အုပ်ချုပ်ရေးစနစ်သစ် ဖော်ဆောင်ခဲ့စဉ် ယင်းအုပ်ချုပ်ရေးစနစ်သစ်နှင့်အညီ ပို့ဆောင်ဆက်သွယ်ရေးဝန်ကြီးဌာန (Ministry of Transport and Telecommunications) ၏အောက်တွင် ဆက်သွယ်ရေးဆိုင်ရာ ပြည်တွင်း ပြည်ပဥပဒေ၊ နည်းဥပဒေ၊ ညွှန်ကြားချက်၊ အမိန့်လုပ်ထုံးလုပ်နည်း စသည်တို့ကို လိုက်နာစေရန် ထိန်းသိမ်းကွပ်ကဲသည့် အဖွဲ့ အဖြစ် ဆက်သွယ်ရေးညွှန်ကြားမှုဦးစီးဌာနနှင့် ဆက်သွယ်ရေး ဝန်ဆောင်မှုလုပ်ငန်း (စာတိုက်/ ကြေးနန်း / တယ်လီဖုန်း )လုပ်ကိုင်သည့် ဆက်သွယ်ရေးကော်ပိုရေးရှင်းဟူ၍ အဖွဲ့အစည်းနှစ်ရပ် ပြင်ဆင် ဖွဲ့စည်းခဲ့ပါသည်။";
// String visionBodyText =
//     "နိုင်ငံတော်အစိုးရမှ ဆက်သွယ်ရေးနှင့် သတင်းနည်းပညာ ကဏ္ဍဖွံ့ဖြိုးတိုးတက်ရေးသည် တစ်မျိုးသားလုံး၊ တစ်နိုင်ငံလုံး ဘက်စုံဖွံ့ဖြိုးတိုးတက်မှုအတွက် အခြေခံဖြစ်သည်ဟု ခံယူထားသည် နှင့်အညီ ပြည်တွင်းရှိ ဆက်သွယ်ရေးနှင့် သတင်းနည်းပညာကဏ္ဍ ဖွံ့ဖြိုးတိုးတက်ရေး လုပ်ငန်းစဉ် များ ကို ဆက်သွယ်ရေးကွန်ရက်များ တိုးချဲ့တည်ဆောက်ခြင်း၊ နည်းပညာသစ်များကို အသုံးပြု၍ ပိုမို အရည်အသွေးမြင့်မားသည့် ဝန်ဆောင်မှုများပေးနိုင်ရန် ပို့ဆောင်ရေးနှင့် ဆက်သွယ်ရေး၀န်ကြီးဌာနက ကြိုးပမ်းဆောင်ရွက်နေသကဲ့သို့ ICT ကဏ္ဍတွင် ဒေသတွင်းနှင့် နိုင်ငံတကာ ပူးပေါင်းဆောင်ရွက်ရေး အစီအစဉ်များ၌လည်း တိုးတက်အောင်ဆောင်ရွက်လျက် ရှိပါသည်။";
// String missionBodyText =
//     "နိုင်ငံတော်အစိုးရမှ ဆက်သွယ်ရေးနှင့် သတင်းနည်းပညာ ကဏ္ဍဖွံ့ဖြိုးတိုးတက်ရေးသည် တစ်မျိုးသားလုံး၊ တစ်နိုင်ငံလုံး ဘက်စုံဖွံ့ဖြိုးတိုးတက်မှုအတွက် အခြေခံဖြစ်သည်ဟု ခံယူထားသည် နှင့်အညီ ပြည်တွင်းရှိ ဆက်သွယ်ရေးနှင့် သတင်းနည်းပညာကဏ္ဍ ဖွံ့ဖြိုးတိုးတက်ရေး လုပ်ငန်းစဉ် များ ကို ဆက်သွယ်ရေးကွန်ရက်များ တိုးချဲ့တည်ဆောက်ခြင်း၊ နည်းပညာသစ်များကို အသုံးပြု၍ ပိုမို အရည်အသွေးမြင့်မားသည့် ဝန်ဆောင်မှုများပေးနိုင်ရန် ပို့ဆောင်ရေးနှင့် ဆက်သွယ်ရေး၀န်ကြီးဌာနက ကြိုးပမ်းဆောင်ရွက်နေသကဲ့သို့ ICT ကဏ္ဍတွင် ဒေသတွင်းနှင့် နိုင်ငံတကာ ပူးပေါင်းဆောင်ရွက်ရေး အစီအစဉ်များ၌လည်း တိုးတက်အောင်ဆောင်ရွက်လျက် ရှိပါသည်။";
// String announceDetailText =
//     "၁။ မကြာသေးခင်က ထွက်ရှိခဲ့သော CrowdStrike Falcon Sensor ၏ Update ကြောင့် နိုင်ငံတကာရှိ ထောင်နှင့်ချီသော Windows စနစ်သုံးကွန်ပျူတာများသည် စက်ဖွင့်ချိန်တွင် Blue Screen of Death (BSOD) Error ဖြစ်ပွားလျက်ရှိပြီး နိုင်ငံတကာရှိ CrowdStrike Falcon ဆော့ဖ်ဝဲလ် အသုံးပြုသော ဘဏ်များ၊ လေကြောင်းလိုင်းများ၊ ရုပ်သံထုတ်လွှင့်ရေးနှင့် အရေးပေါ်ဝန်ဆောင်မှုအချို့တွင် လုပ်ငန်းဆောင်တာ ရပ်ဆိုင်းမှုများ ဖြစ်ပေါ်လျက်ရှိပါသည်။ ၂။ CrowdStrike အနေဖြင့် အဆိုပါပြဿနာအား ဖြေရှင်းနိုင်ရန် Patch ဖိုင်ကို ထုတ်ပေးပြီး ဖြစ်သော်လည်း Windows ကို ပုံမှန်အတိုင်း ဝင်ရောက်နိုင်ခြင်း မရှိသေးသောကြောင့် IT Administrator များအနေဖြင့် BSOD Error အား ဖြေရှင်းနိုင်ရန်အတွက် အောက်ပါအတိုင်း ဆောင်ရွက်ရန် အကြံပြုအပ်ပါသည်- (က) Windows အား Safe Mode သို့မဟုတ် Windows Recovery Environment အနေအထားဖြင့် Boot ပြုလုပ်ရမည်။ (Hirens Boot CD ဖြင့်လည်း Boot ပြုလုပ်နိုင်ပါသည်။) (ခ) Windows တက်လာသော် C:\Windows\System32\drivers\CrowdStrike Folder ရှိရာသို့ သွားပါ။ (ဂ) ထို့နောက် CrowdStrike Folder အောက်တွင် C-00000291*.sys ဟု ရှာပြီး ကိုက်ညီသော ဖိုင်များအားလုံးကို ဖျက်ပစ်ပါ။ (ဃ) ဖိုင်များအား ဖျက်ပြီးသောအခါ Windows အား ပုံမှန်အတိုင်း Reboot ပြုလုပ်ပါ။ ၃။ အထက်ပါအကြံပြုချက်များသည် ဗိုင်းရပ်စ်နှိမ်နှင်းရေးပရိုဂရမ်ဖြစ်သည့် CrowdStrike Falcon ကို သုံးစွဲသူများအတွက်သာဖြစ်ပြီး အခြားသော ဗိုင်းရပ်စ်နှိမ်နှင်ရေးပရိုဂရမ် သုံးစွဲသူများအနေဖြင့် အကြံပြုချက်များအား လုပ်ဆောင်ရန် မလိုအပ်ပါကြောင်း သတိပေးကြေညာအပ်ပါသည်။";

// List imageUrl = [
//   ImageResourceManager.busOne,
//   ImageResourceManager.busTwo,
//   ImageResourceManager.busThree,
//   ImageResourceManager.busFour
// ];
// List<Map<String, dynamic>> visionImage = [
//   {
//     "file_Path": "http://103.89.50.68/assets/bus111.jpg",
//   },
// ];
// List<Map<String, dynamic>> missionImage = [
//   {
//     "file_Path": "http://103.89.50.68/assets/bus9.jpg",
//   },
//   {
//     "file_Path": "http://103.89.50.68/assets/bus3.jpeg",
//   },
// ];
